app/views/favorites/_favorite-btn.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
    <% end %>
    <%= book.favorites.count %>