app/mailers/daily_mailer.rb

  def notify_user
    mail(:subject => "確認メール", bcc: User.pluck(:email))
---
SELECT "users"."email" FROM "users"