app/views/book_comments/_comment.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
---
<ul>
  <% book.book_comments.each do |book_comment| %>

INSERT INTO "book_comments" ("created_at", "updated_at", "comment", "book_id", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2020-10-20 04:57:09.799275"], ["updated_at", "2020-10-20 04:57:09.799275"], ["comment", "ffff"], ["book_id", 1], ["user_id", 5]]
---
            <span class="comment-meta">
              <span class="comment-date"><%= book_comment.created_at.strftime('%Y/%m/%d') %></span>