app/views/book_comments/destroy.js.erb

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
$('#book_<%= @book.id %> .comments-count').html("コメント数: <%= @book.book_comments.count %>");