app/views/users/show.html.erb

              <td><%= book.body %></td>
              <td>コメント数:<i class="fa fa-comment"></i><a href="#comments"><%= book.book_comments.count %></a></td>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]