app/views/books/index.html.erb

					      <% end %>
					      <%= book.favorites.count %>
					    </td>
					    <td>コメント数:<i class="fa fa-comment"></i><a href="#comments"><%= book.book_comments.count %></a></td>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]