app/views/books/index.html.erb

SELECT "books".* FROM "books"
---
					    <td class="favorite-btn"><%= render "favorites/favorite-btn", book: book %></td>
					    <td class="comments-count">コメント数: <%= book.book_comments.count %></td>