app/views/books/show.html.erb

				<% end %>
               <%= @book.favorites.count %>
			</td>
			<td>コメント数:<i class="fa fa-comment"></i><a href="#comments"><%= @book.book_comments.count %></a></td>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]

		<ol>
		  <% @book.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]