app/controllers/book_comments_controller.rb

  def create
    @book = Book.find(params[:book_id])
    comment = @book.book_comments.new(book_comment_params)
    comment.book_id = @book.id
    comment.user_id = current_user.id
    comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("created_at", "updated_at", "comment", "book_id", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2020-10-20 08:26:16.482916"], ["updated_at", "2020-10-20 08:26:16.482916"], ["comment", "kkkk"], ["book_id", 1], ["user_id", 5]]

  def destroy
    @book_comment = BookComment.find(params[:id])
    @book = @book_comment.book
    @book_comment.destroy
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 1], ["book_id", 1], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 11]]