app/controllers/chats_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "user_rooms"."room_id" FROM "user_rooms" WHERE "user_rooms"."user_id" = ?  [["user_id", 9]]
SELECT  "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ? AND "user_rooms"."room_id" IN (?, ?) LIMIT ?  [["user_id", 1], ["room_id", 1], ["room_id", 2], ["LIMIT", 1]]
INSERT INTO "rooms" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-10-24 12:15:50.508113"], ["updated_at", "2020-10-24 12:15:50.508113"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["room_id", 3], ["created_at", "2020-10-24 12:15:50.526956"], ["updated_at", "2020-10-24 12:15:50.526956"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["room_id", 3], ["created_at", "2020-10-24 12:15:50.543107"], ["updated_at", "2020-10-24 12:15:50.543107"]]
---
  def show
    @user = User.find(params[:id])

    # カレントユーザーのuser_roomsにあるroom_idの値の配列を代入
    rooms = current_user.user_rooms.pluck(:room_id)

    # user_roomモデルから、user_idがチャット相手のidが一致するものと、
    # room_idが上記roomsのどれかに一致するレコードをuser_roomsに代入
    user_rooms = UserRoom.find_by(user_id: @user.id, room_id: rooms)

    unless user_rooms.nil?
      # @roomに上記user_roomのroomを代入
      @room = user_rooms.room
    else
      # それ以外は新しくroomを作り、
      @room = Room.new
      @room.save
      # user_roomをカレントユーザー分とチャット相手分を作る
      UserRoom.create(user_id: current_user.id, room_id: @room.id)
      UserRoom.create(user_id: @user.id, room_id: @room.id)

INSERT INTO "chats" ("user_id", "room_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 9], ["room_id", 1], ["content", "gasd"], ["created_at", "2020-10-24 11:41:32.150839"], ["updated_at", "2020-10-24 11:41:32.150839"]]
---
  def create
    @chat = current_user.chats.new(chat_params)
    @chat.save