app/models/user.rb

INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 1], ["followed_id", 9], ["created_at", "2020-10-24 11:49:18.447203"], ["updated_at", "2020-10-24 11:49:18.447203"]]
---
  def follow(user_id)
    relationships.create(followed_id: user_id)

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 31]]
---
  def unfollow(user_id)
    relationships.find_by(followed_id: user_id).destroy

SELECT  1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 9], ["book_id", 1], ["LIMIT", 1]]
---
  def already_favorited?(book)
    self.favorites.exists?(book_id: book.id)